In [2]:
import pandas as pd
data = pd.read_csv("table.csv")
print(data)

     EID     Name Gender   Salary
0  EMP01   ayushi      F      NaN
1  EMP02    rohit      M  25000.0
2  EMP03   monika      F  27000.0
3  EMP04  pranjal    NaN  20000.0
4  EMP01      NaN      M  30000.0
5  EMP05    rohit      M      NaN
6  EMP06    rohit      M  15000.0
7  EMP02    disha      F  27000.0

In [3]:
print(data["EID"].duplicated().sum())

2

In [4]:
print(data.drop_duplicates("EID"))

     EID     Name Gender   Salary
0  EMP01   ayushi      F      NaN
1  EMP02    rohit      M  25000.0
2  EMP03   monika      F  27000.0
3  EMP04  pranjal    NaN  20000.0
5  EMP05    rohit      M      NaN
6  EMP06    rohit      M  15000.0

In [5]:
print(data.isnull().sum())

EID       0
Name      1
Gender    1
Salary    2
dtype: int64

In [6]:
import numpy as np
data["Salary"] = data["Salary"].replace(np.nan,data["Salary"].mean())
print(data)

     EID     Name Gender   Salary
0  EMP01   ayushi      F  24000.0
1  EMP02    rohit      M  25000.0
2  EMP03   monika      F  27000.0
3  EMP04  pranjal    NaN  20000.0
4  EMP01      NaN      M  30000.0
5  EMP05    rohit      M  24000.0
6  EMP06    rohit      M  15000.0
7  EMP02    disha      F  27000.0

In [7]:
print(data.fillna(method = "bfill"))

     EID     Name Gender   Salary
0  EMP01   ayushi      F  24000.0
1  EMP02    rohit      M  25000.0
2  EMP03   monika      F  27000.0
3  EMP04  pranjal      M  20000.0
4  EMP01    rohit      M  30000.0
5  EMP05    rohit      M  24000.0
6  EMP06    rohit      M  15000.0
7  EMP02    disha      F  27000.0

C:\Users\missj\AppData\Local\Temp\ipykernel_2052\2754045057.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "bfill"))

In [8]:
print(data.fillna(method = "ffill"))

     EID     Name Gender   Salary
0  EMP01   ayushi      F  24000.0
1  EMP02    rohit      M  25000.0
2  EMP03   monika      F  27000.0
3  EMP04  pranjal      F  20000.0
4  EMP01  pranjal      M  30000.0
5  EMP05    rohit      M  24000.0
6  EMP06    rohit      M  15000.0
7  EMP02    disha      F  27000.0

C:\Users\missj\AppData\Local\Temp\ipykernel_2052\1391920301.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "ffill"))

In [9]:
df = pd.read_excel("employee.xlsx")
# print(df.tail(10))

df.loc[(df["Bonus %"] == 0), "GetBonus"] = "No Bonus"
df.loc[(df["Bonus %"] > 0), "GetBonus"] = "Bonus"
print(df.head(10))

  Employee ID         Full Name              Job Title   Department  \
0      E02002            Kai Le      Controls Engineer  Engineering
1      E02003      Robert Patel                Analyst        Sales
2      E02004        Cameron Lo  Network Administrator           IT
3      E02005   Harper Castillo   IT Systems Architect           IT
4      E02006  Harper Dominguez               Director  Engineering
5      E02007           Ezra Vu  Network Administrator           IT
6      E02008           Jade Hu                    NaN   Accounting
7      E02009       Miles Chang             Analyst II      Finance
8      E02010     Gianna Holmes  System Administrator            IT
9      E02011    Jameson Thomas                Manager      Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0           Manufacturing    Male      Asian   47 2022-02-05          92368
1               Corporate    Male      Asian   58 2013-10-23          45703
2  Research & Development    Male      Asian   34 2019-03-24          83576
3               Corporate  Female     Latino   39 2018-04-07          98062
4               Corporate  Female     Latino   42 2005-06-18         175391
5           Manufacturing    Male      Asian   62 2004-04-22          66227
6      Specialty Products  Female      Asian   58 2009-06-27          89744
7               Corporate    Male      Asian   62 1999-02-19          69674
8           Manufacturing  Female  Caucasian   38 2011-09-09          97630
9      Specialty Products    Male  Caucasian   52 2015-02-05         105879

   Bonus %        Country       City  Exit Date  GetBonus
0     0.00  United States   Columbus        NaT  No Bonus
1     0.00  United States    Chicago        NaT  No Bonus
2     0.00          China   Shanghai        NaT  No Bonus
3     0.00  United States    Seattle        NaT  No Bonus
4     0.24  United States     Austin        NaT     Bonus
5     0.00  United States    Phoenix 2014-02-14  No Bonus
6     0.00          China  Chongqing        NaT  No Bonus
7     0.00          China    Chengdu        NaT  No Bonus
8     0.00  United States    Seattle        NaT  No Bonus
9     0.10  United States      Miami        NaT     Bonus

In [19]:
data = pd.read_excel("table2.xlsx")
# print(data)

data["Full Name"] = data["FirstName"].str.capitalize() +" "+ data["LastName"].str.capitalize()
data["Bonus"] = (data["Salary"]/100)*20
print(data)

  FirstName   LastName  Salary EID        Full Name    Bonus
0      ross  tribbiani   20000  E1   Ross Tribbiani   4000.0
1    rachel      bing    40000  E2     Rachel Bing    8000.0
2    monica      green   25000  E7     Monica Green   5000.0
3      joey     geller   60000  E8      Joey Geller  12000.0
4  chandler     buffay   33000  E4  Chandler Buffay   6600.0
5    phoebe      bing    45000  E5     Phoebe Bing    9000.0

In [24]:
data = {"Months":["January","February","March","April"]}
a = pd.DataFrame(data)
# print(a)

def extract(values):
        return values[0:3]

a["Short_months"] = a["Months"].map(extract)
print(a)

     Months Short_months
0   January          Jan
1  February          Feb
2     March          Mar
3     April          Apr

In [26]:
data = pd.read_excel("employee.xlsx")
print(data.head(10))

  Employee ID         Full Name              Job Title   Department  \
0      E02002            Kai Le      Controls Engineer  Engineering
1      E02003      Robert Patel                Analyst        Sales
2      E02004        Cameron Lo  Network Administrator           IT
3      E02005   Harper Castillo   IT Systems Architect           IT
4      E02006  Harper Dominguez               Director  Engineering
5      E02007           Ezra Vu  Network Administrator           IT
6      E02008           Jade Hu                    NaN   Accounting
7      E02009       Miles Chang             Analyst II      Finance
8      E02010     Gianna Holmes  System Administrator            IT
9      E02011    Jameson Thomas                Manager      Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0           Manufacturing    Male      Asian   47 2022-02-05          92368
1               Corporate    Male      Asian   58 2013-10-23          45703
2  Research & Development    Male      Asian   34 2019-03-24          83576
3               Corporate  Female     Latino   39 2018-04-07          98062
4               Corporate  Female     Latino   42 2005-06-18         175391
5           Manufacturing    Male      Asian   62 2004-04-22          66227
6      Specialty Products  Female      Asian   58 2009-06-27          89744
7               Corporate    Male      Asian   62 1999-02-19          69674
8           Manufacturing  Female  Caucasian   38 2011-09-09          97630
9      Specialty Products    Male  Caucasian   52 2015-02-05         105879

   Bonus %        Country       City  Exit Date
0     0.00  United States   Columbus        NaT
1     0.00  United States    Chicago        NaT
2     0.00          China   Shanghai        NaT
3     0.00  United States    Seattle        NaT
4     0.24  United States     Austin        NaT
5     0.00  United States    Phoenix 2014-02-14
6     0.00          China  Chongqing        NaT
7     0.00          China    Chengdu        NaT
8     0.00  United States    Seattle        NaT
9     0.10  United States      Miami        NaT

In [30]:
gp = data.groupby(["Department","Gender"]).agg({"Employee ID":"count"})
print(gp)

                        Employee ID
Department      Gender
Accounting      Female           57
                Male             58
Engineering     Female           71
                Male             70
Finance         Female           50
                Male             48
Human Resources Female           59
                Male             50
IT              Female          139
                Male            138
Marketing       Female           64
                Male             46
Sales           Female           75
                Male             75

In [41]:
gp1 = data.groupby(["Country","Gender"]).agg({"Annual Salary":"min","Age":"max"})
print(gp1)

                      Annual Salary  Age
Country       Gender
Brazil        Female          42075   65
              Male            42994   65
China         Female          40352   65
              Male            40778   65
United States Female          41616   65
              Male            40499   65

In [46]:
data1 = {"EID": ["E01","E02","E03","E04","E05","E06"],
        "Name": ["Ram","Shyam","Rita","Vishal","Rani","John"],
        "Age": [34,42,23,26,31,29]}
data2 = {"EID": ["E01","E07","E03","E04","E08","E06"],
        "Salary": [23000,34000,20000,30000,15000,21000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print(df2)

   EID    Name  Age
0  E01     Ram   34
1  E02   Shyam   42
2  E03    Rita   23
3  E04  Vishal   26
4  E05    Rani   31
5  E06    John   29
   EID  Salary
0  E01   23000
1  E07   34000
2  E03   20000
3  E04   30000
4  E08   15000
5  E06   21000

In [54]:
print(pd.merge(df1,df2,on="EID", how= "left"))

   EID    Name  Age   Salary
0  E01     Ram   34  23000.0
1  E02   Shyam   42      NaN
2  E03    Rita   23  20000.0
3  E04  Vishal   26  30000.0
4  E05    Rani   31      NaN
5  E06    John   29  21000.0

In [52]:
print(pd.merge(df1,df2,on="EID", how= "right"))

   EID    Name   Age  Salary
0  E01     Ram  34.0   23000
1  E07     NaN   NaN   34000
2  E03    Rita  23.0   20000
3  E04  Vishal  26.0   30000
4  E08     NaN   NaN   15000
5  E06    John  29.0   21000

In [55]:
print(pd.merge(df1,df2,on="EID", how= "outer"))

   EID    Name   Age   Salary
0  E01     Ram  34.0  23000.0
1  E02   Shyam  42.0      NaN
2  E03    Rita  23.0  20000.0
3  E04  Vishal  26.0  30000.0
4  E05    Rani  31.0      NaN
5  E06    John  29.0  21000.0
6  E07     NaN   NaN  34000.0
7  E08     NaN   NaN  15000.0

In [74]:
dict = {"Fruit":["Mango","Pineapple","Banana","Apple"],
       "Price":[100,45,80,220],
       "Quantity":[20,5,12,15]}
df1 = pd.DataFrame(dict)
print(df1)

df2 = df1.copy()
df2.loc[0,"Price"]=120
df2.loc[1,"Price"]=40
df2.loc[3,"Price"]=200
df2.loc[0,"Quantity"]=12
df2.loc[1,"Quantity"]=6
df2.loc[2,"Quantity"]=10
df2.loc[3,"Quantity"]=8

print(df2)
print(df1.compare(df2,keep_shape=True))

       Fruit  Price  Quantity
0      Mango    100        20
1  Pineapple     45         5
2     Banana     80        12
3      Apple    220        15
       Fruit  Price  Quantity
0      Mango    120        12
1  Pineapple     40         6
2     Banana     80        10
3      Apple    200         8
  Fruit        Price        Quantity
   self other   self  other     self other
0   NaN   NaN  100.0  120.0       20    12
1   NaN   NaN   45.0   40.0        5     6
2   NaN   NaN    NaN    NaN       12    10
3   NaN   NaN  220.0  200.0       15     8

In [81]:
#pivoting
dict = {"keys":["k1","k2","k1","k2"],
       "Names":["Shila","Reeta","Mohan","Malti"],
       "House":["Red","Yellow","Green","Blue"],
       "Grade":["4th","6th","2nd","5th"]}

df = pd.DataFrame(dict)
# print(df)
print(df.pivot(index="keys",columns="Names",values=["House","Grade"]))

      House                      Grade
Names Malti  Mohan   Reeta Shila Malti Mohan Reeta Shila
keys
k1      NaN  Green     NaN   Red   NaN   2nd   NaN   4th
k2     Blue    NaN  Yellow   NaN   5th   NaN   6th   NaN

In [85]:
#melting
dict = {"Names":["Shila","Reeta","Mohan","Malti"],
       "House":["Red","Yellow","Green","Blue"],
       "Grade":["4th","6th","2nd","5th"]}

df = pd.DataFrame(dict)
#print(df)
print(pd.melt(df,id_vars=["Names"],value_vars=["House","Grade"]))

   Names variable   value
0  Shila    House     Red
1  Reeta    House  Yellow
2  Mohan    House   Green
3  Malti    House    Blue
4  Shila    Grade     4th
5  Reeta    Grade     6th
6  Mohan    Grade     2nd
7  Malti    Grade     5th